Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_dcd_int.c
/**
 *******************************************************************************
 * @file  hc32f4a0_usb_dcd_int.c
 * @brief Peripheral Device interrupt subroutines.
 * 
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Wangmin         First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */


/*******************************************************************************
 * Include files
 ******************************************************************************/
#include <stdio.h>
#include "hc32f4a0_usb_dcd_int.h"
#include "usb_bsp.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_USB_DCD_INT USB DCD INT
 * @brief USB interrupt handle for device mode.
 * @{
 */

#if (DDL_USBFS_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/**
 * @defgroup USB_DCD_INT_Local_Functions USB DCD INT Local Functions
 * @{
 */

static uint32_t DCD_ReadDevInEP (USB_OTG_CORE_HANDLE *pdev, uint8_t epnum);

/* Interrupt Handlers */
static uint32_t DCD_HandleInEP_ISR(USB_OTG_CORE_HANDLE *pdev);
static uint32_t DCD_HandleOutEP_ISR(USB_OTG_CORE_HANDLE *pdev);
static uint32_t DCD_HandleSof_ISR(USB_OTG_CORE_HANDLE *pdev);

static uint32_t DCD_HandleRxStatusQueueLevel_ISR(USB_OTG_CORE_HANDLE *pdev);
static uint32_t DCD_WriteEmptyTxFifo(USB_OTG_CORE_HANDLE *pdev , uint32_t epnum);

static uint32_t DCD_HandleUsbReset_ISR(USB_OTG_CORE_HANDLE *pdev);
static uint32_t DCD_HandleEnumDone_ISR(USB_OTG_CORE_HANDLE *pdev);
static uint32_t DCD_HandleResume_ISR(USB_OTG_CORE_HANDLE *pdev);
static uint32_t DCD_HandleUSBSuspend_ISR(USB_OTG_CORE_HANDLE *pdev);

static uint32_t DCD_IsoINIncomplete_ISR(USB_OTG_CORE_HANDLE *pdev);
static uint32_t DCD_IsoOUTIncomplete_ISR(USB_OTG_CORE_HANDLE *pdev);
#ifdef VBUS_SENSING_ENABLED
static uint32_t DCD_SessionRequest_ISR(USB_OTG_CORE_HANDLE *pdev);
//static uint32_t DCD_OTG_ISR(USB_OTG_CORE_HANDLE *pdev);
#endif

/**
 * @}
 */

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
/**
 * @defgroup USB_DCD_INT_Local_Variables USB DCD INT Local Variables
 * @{
 */
char const *state_str[7U] =
{
    "idle",
    "setup",
    "data_in",
    "data_out",
    "status_in",
    "status_out",
    "stall"
};
/**
 * @}
 */


/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup USB_DCD_INT_Global_Functions USB DCD INT Global Functions
 * @{
 */

#ifdef USB_OTG_HS_DEDICATED_EP1_ENABLED
/**
 * @brief  USBD_OTG_EP1OUT_ISR_Handler
 *        handles all USB Interrupts
 * @param  pdev     device instance
 * @retval status
 */
uint32_t USBD_OTG_EP1OUT_ISR_Handler (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_DOEPINTn_TypeDef  doepint;
    USB_OTG_DEPXFRSIZ_TypeDef  deptsiz;

    doepint.d32 = USB_OTG_READ_REG32(&pdev->regs.OUTEP_REGS[1U]->DOEPINT);
    doepint.d32&= USB_OTG_READ_REG32(&pdev->regs.DREGS->DOUTEP1MSK);

    /* Transfer complete */
    if ( doepint.b.xfercompl )
    {
        /* Clear the bit in DOEPINTn for this interrupt */
        CLEAR_OUT_EP_INTR(1U, out_xfercompl);
        if (pdev->cfg.dma_enable == 1U)
        {
            deptsiz.d32 = USB_OTG_READ_REG32(&(pdev->regs.OUTEP_REGS[1U]->DOEPTSIZ));
            /*ToDo : handle more than one single MPS size packet */
            pdev->dev.out_ep[1].xfer_count = pdev->dev.out_ep[1U].maxpacket - \
            deptsiz.b.xfersize;
        }
        /* Inform upper layer: data ready */
        /* RX COMPLETE */
        USBD_DCD_INT_fops->DataOutStage(pdev , 1U);
    }

    /* Endpoint disable  */
    if ( doepint.b.epdisabled )
    {
        /* Clear the bit in DOEPINTn for this interrupt */
        CLEAR_OUT_EP_INTR(1U, out_epdisabled);
    }

    return 1UL;
}

/**
 * @brief  USBD_OTG_EP1IN_ISR_Handler
 *         handles all USB Interrupts
 * @param  pdev     device instance
 * @retval status
 */
uint32_t USBD_OTG_EP1IN_ISR_Handler (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_DIEPINTn_TypeDef  diepint;
    uint32_t fifoemptymsk, msk, emp;

    msk = USB_OTG_READ_REG32(&pdev->regs.DREGS->DINEP1MSK);
    emp = USB_OTG_READ_REG32(&pdev->regs.DREGS->DIEPEMPMSK);
    msk |= ((emp >> 1U ) & 0x1U) << 7U;
    diepint.d32  = USB_OTG_READ_REG32(&pdev->regs.INEP_REGS[1U]->DIEPINT) & msk;

    if ( diepint.b.xfercompl )
    {
        fifoemptymsk = 0x1U << 1U;
        USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DIEPEMPMSK, fifoemptymsk, 0U);
        CLEAR_IN_EP_INTR(1U, in_xfercompl);
        /* TX COMPLETE */
        USBD_DCD_INT_fops->DataInStage(pdev , 1U);
    }
    if ( diepint.b.epdisabled )
    {
        CLEAR_IN_EP_INTR(1U, in_epdisabled);
    }
    if ( diepint.b.timeout )
    {
        CLEAR_IN_EP_INTR(1U, in_timeout);
    }
    if (diepint.b.intktxfemp)
    {
        CLEAR_IN_EP_INTR(1U, in_intktxfemp);
    }
    if (diepint.b.inepnakeff)
    {
        CLEAR_IN_EP_INTR(1U, in_inepnakeff);
    }
    if (diepint.b.emptyintr)
    {
        DCD_WriteEmptyTxFifo(pdev , 1U);
        CLEAR_IN_EP_INTR(1U, in_emptyintr);
    }
    return 1;
}
#endif /* USB_OTG_HS_DEDICATED_EP1_ENABLED */

/**
 * @brief  USBF_OTG_ISR_Handler
 *         handles all USB Interrupts
 * @param  pdev     Device instance
 * @retval Status
 */
uint32_t USBD_OTG_ISR_Handler (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTSTS_TypeDef  gintr_status;
    uint32_t retval = 0UL;
    uint32_t ReadCoreItrTemp = 0UL;   /* C-STAT */

    if (USB_OTG_IsDeviceMode(pdev)) /* ensure that we are in device mode */
    {
        ReadCoreItrTemp = USB_OTG_ReadCoreItr(pdev);      /* C-STAT */
        gintr_status.b = *(stc_bUSB_OTG_GINTSTS_t*)&ReadCoreItrTemp;   /* C-STAT */
        /* avoid spurious interrupt */
        if (!*(uint32_t*)&gintr_status.b) /* C-STAT */
        {
            retval = 0UL;  /* MISRAC 2004*/
        }
        /* Out endpoint interrupt */
        else if (gintr_status.b.outepintr)
        {
            retval |= DCD_HandleOutEP_ISR(pdev);
        }
        /* In endpoint interrupt */
        else if (gintr_status.b.inepint)
        {
            retval |= DCD_HandleInEP_ISR(pdev);
        }
        /* Mode mismatch interrupt */
        else if (gintr_status.b.modemismatch)
        {
            USB_OTG_GINTSTS_TypeDef  gintsts;

