Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_dcd_int.c
            /* Clear interrupt */
            gintsts.d32 = 0UL;
            gintsts.b.modemismatch = 1U;
            USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GINTSTS, gintsts.d32);
        }
        /* Resume/remote wakeup detected interrupt */
        else if (gintr_status.b.wkupintr)
        {
            retval |= DCD_HandleResume_ISR(pdev);
        }
        /* USB suspend interrupt */
        else if (gintr_status.b.usbsuspend)
        {
            retval |= DCD_HandleUSBSuspend_ISR(pdev);
        }
        /* Start of frame interrupt */
        else if (gintr_status.b.sofintr)
        {
            retval |= DCD_HandleSof_ISR(pdev);
        }
        /* RxFIFO non-empty interrupt */
        else if (gintr_status.b.rxstsqlvl)
        {
            retval |= DCD_HandleRxStatusQueueLevel_ISR(pdev);
        }
        /* USB reset interrupt */
        else if (gintr_status.b.usbreset)
        {
            retval |= DCD_HandleUsbReset_ISR(pdev);
        }
        /* Enumeration done interrupt */
        else if (gintr_status.b.enumdone)
        {
            retval |= DCD_HandleEnumDone_ISR(pdev);
        }
        /* Incomplete periodic transfer */
        else if (gintr_status.b.incomplisoin)
        {
            retval |= DCD_IsoINIncomplete_ISR(pdev);
        }
        /* Incomplete isochronous IN transfer */
        else if (gintr_status.b.incomplisoout)
        {
            retval |= DCD_IsoOUTIncomplete_ISR(pdev);
        }

#ifdef VBUS_SENSING_ENABLED
        /* VBUS valid interrupt */
        else if (gintr_status.b.vbusvint)
        {
            printf("vbus\n");
            retval |= DCD_SessionRequest_ISR(pdev);
        }

    //    else if (gintr_status.b.otgintr)
    //    {
    //      retval |= DCD_OTG_ISR(pdev);
    //    }
        else
        {
            //
        }
#endif
    }
    return retval;
}

/**
 * @}
 */


/**
 * @addtogroup USB_DCD_INT_Local_Functions USB DCD INT Local Functions
 * @{
 */

#ifdef VBUS_SENSING_ENABLED
/**
 * @brief  DCD_SessionRequest_ISR
 *         Indicates that the USB_OTG controller has detected a connection
 * @param  pdev     device instance
 * @retval Status
 */
static uint32_t DCD_SessionRequest_ISR(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTSTS_TypeDef  gintsts;
    USB_OTG_PCGCCTL_TypeDef  power;

    USBD_DCD_INT_fops->DevConnected (pdev);

    printf("SessionRequest !!\n");
    /* Clear interrupt */
    gintsts.d32 = 0UL;
    gintsts.b.vbusvint = 1U;
    USB_OTG_WRITE_REG32 (&pdev->regs.GREGS->GINTSTS, gintsts.d32);

    if(pdev->cfg.low_power)
    {
        /* un-gate USB Core clock */
        power.d32 = USB_OTG_READ_REG32(&pdev->regs.PCGCCTL);
        power.b.gatehclk = 0U;
        power.b.stoppclk = 0U;
        USB_OTG_WRITE_REG32(pdev->regs.PCGCCTL, power.d32);
    }

    return 1UL;
}

/**
 * @brief  DCD_OTG_ISR
 *         Indicates that the USB_OTG controller has detected an OTG event:
 *                used to detect the end of session i.e. disconnection
 * @param  pdev     device instance
 * @retval Status
 */
//static uint32_t DCD_OTG_ISR(USB_OTG_CORE_HANDLE *pdev)
//{
//
//  USB_OTG_GOTGINT_TypeDef  gotgint;
//  printf("\tDCD_OTG_ISR !!\n");
//  gotgint.d32 = USB_OTG_READ_REG32(&pdev->regs.GREGS->GOTGINT);
//
//  if (gotgint.b.sesenddet)
//  {
//    USBD_DCD_INT_fops->DevDisconnected (pdev);
//  }
//  /* Clear OTG interrupt */
//  USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GOTGINT, gotgint.d32);
//  return 1;
//}
#endif  /* VBUS_SENSING_ENABLED */

/**
 * @brief  DCD_HandleResume_ISR
 *         Indicates that the USB_OTG controller has detected a resume or
 *                 remote Wake-up sequence
 * @param  pdev     device instance
 * @retval Status
 */
static uint32_t DCD_HandleResume_ISR(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTSTS_TypeDef  gintsts;
    USB_OTG_DCTL_TypeDef     devctl;
    USB_OTG_PCGCCTL_TypeDef  power;

    printf("resume !!\n");
    if(pdev->cfg.low_power)
    {
        /* un-gate USB Core clock */
        power.d32 = USB_OTG_READ_REG32(&pdev->regs.PCGCCTL);
        power.b.gatehclk = 0U;
        power.b.stoppclk = 0U;
        USB_OTG_WRITE_REG32(pdev->regs.PCGCCTL, power.d32);
    }

    /* Clear the Remote Wake-up Signaling */
    devctl.d32 = 0UL;
    devctl.b.rmtwkupsig = 1U;
    USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DCTL, devctl.d32, 0UL);

    USB_OTG_BSP_mDelay(1UL);
    USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DCTL, devctl.d32, 0UL);

    /* Inform upper layer by the Resume Event */
    USBD_DCD_INT_fops->Resume (pdev);

    /* Clear interrupt */
    gintsts.d32 = 0UL;
    gintsts.b.wkupintr = 1U;
    USB_OTG_WRITE_REG32 (&pdev->regs.GREGS->GINTSTS, gintsts.d32);
    return 1UL;
}

/**
 * @brief  USB_OTG_HandleUSBSuspend_ISR
 *        Indicates that SUSPEND state has been detected on the USB
 * @param  pdev     device instance
 * @retval Status
 */
static uint32_t DCD_HandleUSBSuspend_ISR(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTSTS_TypeDef  gintsts;
    USB_OTG_PCGCCTL_TypeDef  power;
    USB_OTG_DSTS_TypeDef     dsts;
    __IO uint8_t prev_status = 0U;

    printf("suspend !!\n");
    prev_status = pdev->dev.device_status;
    USBD_DCD_INT_fops->Suspend (pdev);

    dsts.b = *(__IO stc_bUSB_OTG_DSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.DREGS->DSTS);   /* C-STAT */

    /* Clear interrupt */
    gintsts.d32 = 0UL;
    gintsts.b.usbsuspend = 1U;
    USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GINTSTS, gintsts.d32);

    if((prev_status  == USB_OTG_CONFIGURED) &&
       (pdev->cfg.low_power) && (dsts.b.suspsts == 1U)  &&
       (pdev->dev.connection_status == 1U))
    {
        /*  switch-off the clocks */
        power.d32 = 0UL;
        power.b.stoppclk = 1U;
        USB_OTG_MODIFY_REG32(pdev->regs.PCGCCTL, 0UL, power.d32);

        power.b.gatehclk = 1U;
        USB_OTG_MODIFY_REG32(pdev->regs.PCGCCTL, 0UL, power.d32);

        /* Request to enter Sleep mode after exit from current ISR */
        // SCB->SCR |= (SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk);
    }
    return 1UL;
}

/**
 * @brief  DCD_HandleInEP_ISR
 *        Indicates that an IN EP has a pending Interrupt
 * @param  pdev     device instance
 * @retval Status
 */
static uint32_t DCD_HandleInEP_ISR(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_DIEPINTn_TypeDef  diepint;

