Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_dcd_int.c
    uint32_t ep_intr;
    uint32_t epnum = 0UL;
    uint32_t fifoemptymsk;
    uint32_t u32ReadInEpTmp = 0UL; /* C-STAT */

    *(uint32_t*)&diepint.b = 0UL;    /* C-STAT */
    ep_intr = USB_OTG_ReadDevAllInEPItr(pdev);

    while ( ep_intr )
    {
        if (ep_intr&0x1U) /* In ITR */
        {
            //diepint.d32 = DCD_ReadDevInEP(pdev , epnum); /* Get In ITR status */  /* C-STAT */
            u32ReadInEpTmp = DCD_ReadDevInEP(pdev , (uint8_t)epnum);
            diepint.b = *(stc_bUSB_OTG_DIEPINTn_t*)&u32ReadInEpTmp;

            if ( diepint.b.xfercompl )
            {
                fifoemptymsk = 0x1UL << epnum;
                USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DIEPEMPMSK, fifoemptymsk, 0UL);
                CLEAR_IN_EP_INTR(epnum, in_xfercompl);
                /* TX COMPLETE */
                USBD_DCD_INT_fops->DataInStage(pdev , epnum);

                if (pdev->cfg.dma_enable == 1U)
                {
                    if((epnum == 0U) && (pdev->dev.device_state == USB_OTG_EP0_STATUS_IN))
                    {
                        /* prepare to rx more setup packets */
                        ///printf("status in\n");
                        USB_OTG_EP0_OutStart(pdev);
                        pdev->dev.device_state = USB_OTG_EP0_IDLE;
                    }
                }
                ///printf("ctrl-in %x\n",USB_OTG_READ_REG32(&(pdev->regs.INEP_REGS[epnum]->DIEPTSIZ)));
            }
            if ( diepint.b.timeout )
            {
                CLEAR_IN_EP_INTR(epnum, in_timeout);
            }
            if (diepint.b.intktxfemp)
            {
                CLEAR_IN_EP_INTR(epnum, in_intktxfemp);
            }
            if (diepint.b.inepnakeff)
            {
                CLEAR_IN_EP_INTR(epnum, in_inepnakeff);
            }
            if ( diepint.b.epdisabled )
            {
                CLEAR_IN_EP_INTR(epnum, in_epdisabled);
            }
            if (diepint.b.emptyintr)
            {
                //printf("empty ep%d\n",epnum);
                DCD_WriteEmptyTxFifo(pdev , epnum);
                CLEAR_IN_EP_INTR(epnum, in_emptyintr);
            }
        }
        epnum++;
        ep_intr >>= 1U;
    }

    return 1UL;
}

/**
 * @brief  DCD_HandleOutEP_ISR
 *         Indicates that an OUT EP has a pending Interrupt
 * @param  pdev     device instance
 * @retval Status
 */
static uint32_t DCD_HandleOutEP_ISR(USB_OTG_CORE_HANDLE *pdev)
{
    uint32_t ep_intr;
    USB_OTG_DOEPINTn_TypeDef  doepint;
    USB_OTG_DEPXFRSIZ_TypeDef  deptsiz;
    uint32_t epnum = 0UL;
    uint32_t xfer;   /* MISRAC*/
    uint32_t u32ReadOutEpTmp = 0UL; /* C-STAT */
    uint32_t u32ReadEpSizeTmp = 0UL; /* C-STAT */

    *(__IO uint32_t*)&doepint.b = 0UL;  /* C-STAT */

    /* Read in the device interrupt bits */
    ep_intr = USB_OTG_ReadDevAllOutEp_itr(pdev);

    while ( ep_intr )
    {
        if (ep_intr&0x1UL)
        {
            //doepint.d32 = USB_OTG_ReadDevOutEP_itr(pdev, epnum);  /* C-STAT */
            u32ReadOutEpTmp = USB_OTG_ReadDevOutEP_itr(pdev, (uint8_t)epnum);
            doepint.b = *(__IO stc_bUSB_OTG_DOEPINTn_t*)&u32ReadOutEpTmp;

            /* Transfer complete */
            if ( doepint.b.xfercompl )
            {
                /* Clear the bit in DOEPINTn for this interrupt */
                CLEAR_OUT_EP_INTR(epnum, out_xfercompl);
                if (pdev->cfg.dma_enable == 1U)
                {
                    //deptsiz.d32 = USB_OTG_READ_REG32(&(pdev->regs.OUTEP_REGS[epnum]->DOEPTSIZ));  /* C-STAT */
                    u32ReadEpSizeTmp = USB_OTG_READ_REG32(&(pdev->regs.OUTEP_REGS[epnum]->DOEPTSIZ));
                    deptsiz.b = *(stc_bUSB_OTG_DEPXFRSIZ_t*)&u32ReadEpSizeTmp;

                    /*ToDo : handle more than one single MPS size packet */
                    xfer = __MIN(pdev->dev.out_ep[epnum].maxpacket,pdev->dev.out_ep[epnum].xfer_len);
                    pdev->dev.out_ep[epnum].xfer_count = xfer - deptsiz.b.xfersize;
                    if (epnum != 0U)
                    {
                        pdev->dev.out_ep[epnum].xfer_count = pdev->dev.out_ep[epnum].xfer_len - deptsiz.b.xfersize;
                    }
                }
                /* Inform upper layer: data ready */
                /* RX COMPLETE */
                USBD_DCD_INT_fops->DataOutStage(pdev , epnum);

                if (pdev->cfg.dma_enable == 1U)
                {
                    if((epnum == 0U) && (pdev->dev.device_state == USB_OTG_EP0_STATUS_OUT))
                    {
                        /* prepare to rx more setup packets */
                        ///printf("status out\n");
                        USB_OTG_EP0_OutStart(pdev);
                        pdev->dev.device_state = USB_OTG_EP0_IDLE;
                    }
                }
            }
            /* Endpoint disable  */
            if ( doepint.b.epdisabled )
            {
                /* Clear the bit in DOEPINTn for this interrupt */
                CLEAR_OUT_EP_INTR(epnum, out_epdisabled);
            }

            //doepint.d32 = USB_OTG_ReadDevOutEP_itr(pdev, epnum);  /* C-STAT */
            u32ReadOutEpTmp = USB_OTG_ReadDevOutEP_itr(pdev, (uint8_t)epnum);
            doepint.b = *(stc_bUSB_OTG_DOEPINTn_t*)&u32ReadOutEpTmp;

            /* Setup Phase Done (control EPs) */
            if ( doepint.b.setup )
            {
                /* inform the upper layer that a setup packet is available */
                /* SETUP COMPLETE */
                USBD_DCD_INT_fops->SetupStage(pdev);
                CLEAR_OUT_EP_INTR(epnum, out_setup);
            }
        }
        epnum++;
        ep_intr >>= 1U;
    }
    return 1UL;
}

/**
 * @brief  DCD_HandleSof_ISR
 *         Handles the SOF Interrupts
 * @param  pdev     device instance
 * @retval Status
 */
static uint32_t DCD_HandleSof_ISR(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTSTS_TypeDef  GINTSTS;


    USBD_DCD_INT_fops->SOF(pdev);

    /* Clear interrupt */
    GINTSTS.d32 = 0UL;
    GINTSTS.b.sofintr = 1U;
    USB_OTG_WRITE_REG32 (&pdev->regs.GREGS->GINTSTS, GINTSTS.d32);

    return 1UL;
}

/**
 * @brief  DCD_HandleRxStatusQueueLevel_ISR
 *         Handles the Rx Status Queue Level Interrupt
 * @param  pdev     device instance
 * @retval Status
 */
static uint32_t DCD_HandleRxStatusQueueLevel_ISR(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTMSK_TypeDef  int_mask;
    USB_OTG_DRXSTS_TypeDef   status;
    USB_OTG_EP *ep;
    uint32_t u32Tmp;

    /* Disable the Rx Status Queue Level interrupt */
    int_mask.d32 = 0UL;
    int_mask.b.rxstsqlvl = 1U;
    USB_OTG_MODIFY_REG32( &pdev->regs.GREGS->GINTMSK, int_mask.d32, 0UL);

    /* Get the Status from the top of the FIFO */
    //status.b = *(__IO stc_bUSB_OTG_DRXSTS_t*)&USB_OTG_READ_REG32( &pdev->regs.GREGS->GRXSTSP ); /* C-STAT */
    u32Tmp = USB_OTG_READ_REG32( &pdev->regs.GREGS->GRXSTSP );
    status.b = *(__IO stc_bUSB_OTG_DRXSTS_t*)&u32Tmp; /* C-STAT */
    ep = &pdev->dev.out_ep[status.b.epnum];

