Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_dcd_int.c
    switch (status.b.pktsts)
    {
        case STS_GOUT_NAK:
            break;
        case STS_DATA_UPDT:
            if (status.b.bcnt)
            {
                //if (status.b.epnum == 2)
                //    printf("ep%d cnt %d\n",status.b.epnum,status.b.bcnt);
                USB_OTG_ReadPacket(pdev,ep->xfer_buff, (uint16_t)status.b.bcnt);
                ep->xfer_buff += status.b.bcnt;
                ep->xfer_count += status.b.bcnt;
            } else
            {
                ;//printf("ep%d cnt %d\n",status.b.epnum,status.b.bcnt);
            }
            break;
        case STS_XFER_COMP:
            break;
        case STS_SETUP_COMP:
            break;
        case STS_SETUP_UPDT:
            /* Copy the setup packet received in FIFO into the setup buffer in RAM */
            //printf("ep%d setup %d\n",status.b.epnum,status.b.bcnt);
            USB_OTG_ReadPacket(pdev , pdev->dev.setup_packet, 8U);
            ep->xfer_count += status.b.bcnt;
            break;
        default:
            break;
    }
    /* Enable the Rx Status Queue Level interrupt */
    USB_OTG_MODIFY_REG32( &pdev->regs.GREGS->GINTMSK, 0UL, int_mask.d32);
    return 1UL;
}

/**
 * @brief  DCD_WriteEmptyTxFifo
 *         check FIFO for the next packet to be loaded
 * @param  pdev     Device instance
 * @param  epnum    Endpoint number
 * @retval Status
 */
static uint32_t DCD_WriteEmptyTxFifo(USB_OTG_CORE_HANDLE *pdev, uint32_t epnum)
{
    USB_OTG_DTXFSTSn_TypeDef  txstatus;
    USB_OTG_EP *ep;
    uint32_t len = 0UL;
    uint32_t len32b;

    *(uint32_t*)&txstatus.b = 0UL;  /* C-STAT */

    ep = &pdev->dev.in_ep[epnum];
    len = ep->xfer_len - ep->xfer_count;

    if (len > ep->maxpacket)
    {
        len = ep->maxpacket;
    }

    len32b = (len + 3U) / 4U;
    txstatus.b = *(__IO stc_bUSB_OTG_DTXFSTSn_t*)&USB_OTG_READ_REG32( &pdev->regs.INEP_REGS[epnum]->DTXFSTS);  /* C-STAT */
    //printf("ep%d tx len %d\n",epnum,len);

    while ((txstatus.b.txfspcavail > len32b) && (ep->xfer_count < ep->xfer_len) && (ep->xfer_len != 0U))
    {
        /* Write the FIFO */
        len = ep->xfer_len - ep->xfer_count;

        if (len > ep->maxpacket)
        {
            len = ep->maxpacket;
        }
        len32b = (len + 3U) / 4U;

        USB_OTG_WritePacket (pdev , ep->xfer_buff, (uint8_t)epnum, (uint16_t)len);

        ep->xfer_buff  += len;
        ep->xfer_count += len;

        txstatus.b = *(__IO stc_bUSB_OTG_DTXFSTSn_t*)&USB_OTG_READ_REG32(&pdev->regs.INEP_REGS[epnum]->DTXFSTS);  /* C-STAT */
    }
    return 1UL;
}

/**
 * @brief  DCD_HandleUsbReset_ISR
 *         This interrupt occurs when a USB Reset is detected
 * @param  pdev     device instance
 * @retval Status
 */
static uint32_t DCD_HandleUsbReset_ISR(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_DAINT_TypeDef    daintmsk;
    USB_OTG_DOEPMSK_TypeDef  doepmsk;
    USB_OTG_DIEPMSK_TypeDef  diepmsk;
    USB_OTG_DCFG_TypeDef     dcfg;
    USB_OTG_DCTL_TypeDef     dctl;
    USB_OTG_GINTSTS_TypeDef  gintsts;
    uint32_t i;

    dctl.d32 = 0UL;
    daintmsk.d32 = 0UL;
    doepmsk.d32 = 0UL;
    diepmsk.d32 = 0UL;
    dcfg.d32 = 0UL;
    gintsts.d32 = 0UL;

    printf("%s\n",__FUNCTION__);
    /* Clear the Remote Wake-up Signaling */
    dctl.b.rmtwkupsig = 1U;
    USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DCTL, dctl.d32, 0UL );

    /* Flush the Tx FIFO */
    USB_OTG_FlushTxFifo(pdev, 0UL);

    for (i = 0UL; i < pdev->cfg.dev_endpoints ; i++)
    {
        USB_OTG_WRITE_REG32( &pdev->regs.INEP_REGS[i]->DIEPINT, 0xFFUL);
        USB_OTG_WRITE_REG32( &pdev->regs.OUTEP_REGS[i]->DOEPINT, 0xFFUL);
    }
    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DAINT, 0xFFFFFFFFUL );

    daintmsk.ep.in = 1U;
    daintmsk.ep.out = 1U;
    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DAINTMSK, daintmsk.d32 );

    doepmsk.b.setup = 1U;
    doepmsk.b.xfercompl = 1U;
    doepmsk.b.epdisabled = 1U;
    doepmsk.b.stsphsercvd = 1U;
    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DOEPMSK, doepmsk.d32 );
#ifdef USB_OTG_HS_DEDICATED_EP1_ENABLED
    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DOUTEP1MSK, doepmsk.d32 );
#endif
    diepmsk.b.xfercompl = 1U;
    diepmsk.b.timeout = 1U;
    diepmsk.b.epdisabled = 1U;

    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DIEPMSK, diepmsk.d32 );
#ifdef USB_OTG_HS_DEDICATED_EP1_ENABLED
    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DINEP1MSK, diepmsk.d32 );
#endif
    /* Reset Device Address */
    dcfg.d32 = USB_OTG_READ_REG32( &pdev->regs.DREGS->DCFG);
    dcfg.b.devaddr = 0U;
    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DCFG, dcfg.d32);

    /* setup EP0 to receive SETUP packets */
    printf("reset\n");
    USB_OTG_EP0_OutStart(pdev);

    /* Clear interrupt */
    gintsts.d32 = 0UL;
    gintsts.b.usbreset = 1UL;
    USB_OTG_WRITE_REG32 (&pdev->regs.GREGS->GINTSTS, gintsts.d32);

    /*Reset internal state machine */
    USBD_DCD_INT_fops->Reset(pdev);
    return 1UL;
}

/**
 * @brief  DCD_HandleEnumDone_ISR
 *         Read the device status register and set the device speed
 * @param  pdev     device instance
 * @retval Status
 */
static uint32_t DCD_HandleEnumDone_ISR(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTSTS_TypeDef  gintsts;
    USB_OTG_GUSBCFG_TypeDef  gusbcfg;

    USB_OTG_EP0Activate(pdev);

    /* Set USB turn-around time based on device speed and PHY interface. */
    gusbcfg.d32 = USB_OTG_READ_REG32(&pdev->regs.GREGS->GUSBCFG);

    /* Full or High speed */
    if ( USB_OTG_GetDeviceSpeed(pdev) == USB_SPEED_HIGH)
    {
        pdev->cfg.speed            = USB_OTG_SPEED_HIGH;
        pdev->cfg.mps              = USB_OTG_HS_MAX_PACKET_SIZE ;
        gusbcfg.b.usbtrdtim = 9U;
    }
    else
    {
        pdev->cfg.speed            = USB_OTG_SPEED_FULL;
        pdev->cfg.mps              = USB_OTG_FS_MAX_PACKET_SIZE ;
        gusbcfg.b.usbtrdtim = 9U;
    }

    USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GUSBCFG, gusbcfg.d32);

    /* Clear interrupt */
    gintsts.d32 = 0UL;
    gintsts.b.enumdone = 1U;
    USB_OTG_WRITE_REG32( &pdev->regs.GREGS->GINTSTS, gintsts.d32 );
    return 1UL;
}

/**
 * @brief  DCD_IsoINIncomplete_ISR
 *         handle the ISO IN incomplete interrupt
 * @param  pdev     device instance
 * @retval Status
 */
static uint32_t DCD_IsoINIncomplete_ISR(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTSTS_TypeDef gintsts;

    gintsts.d32 = 0UL;

    USBD_DCD_INT_fops->IsoINIncomplete (pdev);

    /* Clear interrupt */
    gintsts.b.incomplisoin = 1U;
    USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GINTSTS, gintsts.d32);

    return 1UL;
}

/**
 * @brief  DCD_IsoOUTIncomplete_ISR
 *         handle the ISO OUT incomplete interrupt
 * @param  pdev     device instance
 * @retval Status
 */
static uint32_t DCD_IsoOUTIncomplete_ISR(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTSTS_TypeDef gintsts;

    gintsts.d32 = 0UL;

    USBD_DCD_INT_fops->IsoOUTIncomplete (pdev);

    /* Clear interrupt */
    gintsts.b.incomplisoout = 1U;
    USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GINTSTS, gintsts.d32);
    return 1UL;
}

/**
 * @brief  DCD_ReadDevInEP Reads ep flags
 * @param  pdev     Device instance
 * @param  epnum    Endpoint number
 * @retval Status
 */
static uint32_t DCD_ReadDevInEP (USB_OTG_CORE_HANDLE *pdev, uint8_t epnum)
{
    uint32_t v, msk, emp;
    msk = USB_OTG_READ_REG32(&pdev->regs.DREGS->DIEPMSK);
    emp = USB_OTG_READ_REG32(&pdev->regs.DREGS->DIEPEMPMSK);
    msk |= ((emp >> epnum) & 0x1UL) << 7U;
    v = USB_OTG_READ_REG32(&pdev->regs.INEP_REGS[epnum]->DIEPINT) & msk;
    return v;
}

/**
 * @}
 */

#endif /* DDL_USBFS_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
